const data = {
    announcements: [
        {
            id: 18,
            category: '通用',
            publish_at: 1722142010,
            sorting_index: 999,
            title: '网站静态化提醒及 playground 环境开放',
            content:
                '<p>正式环境 (https://pnku3.pkupuzzle.art) 将会在活动结束的 2 小时之后的任意一个时间进入静态存档状态，届时将无法登录以及查看自己队伍的信息（这次我们已经提前做好了静态化步骤，因此会很快的替换完成），请各队伍做好准备。</p>\n<p>playground 环境已经开放，可以前往 https://pnku3-playground.pkupuzzle.art 查看。目前设置的序章开始时间是 2024-07-28 20:00，正式开始时间是 2024-07-28 21:00。</p>\n<p>正式环境中的账号已经迁移到了 playground 环境中，这意味着你不需要在 playground 环境中重新注册，但是队伍信息并不会迁移，需要重新组队。</p>',
        },
        {
            id: 14,
            category: '通用',
            publish_at: 1721709410,
            sorting_index: 100,
            title: '宇宙变动……',
            content:
                '<ul>\n<li>因为前五十名已经决出，观测者的能力得以回复，注意力增速从 2024-07-28 12:10 开始调整为<strong>每分钟增长 80 点</strong>。</li>\n<li>同时观测者在 2024-07-22 12:00 可以开始对于第一日的谜题使用灵视。在 2024-07-24 01:00 可以开始对于第二日的谜题使用灵视。在 2024-07-26 12:00 可以开始对于第三日的部分谜题、前两日的终极谜题使用灵视。在 2024-07-28 12:10 可以开始对于第三日的终极谜题使用灵视。</li>\n<li><del>但随着时间的流逝，观测者逐渐丧失与芈雨的连接，因此观测者向芈雨请求神谕时，得到回复的时间将从四小时增长为<strong>八小时</strong>。并且，观测者请求神谕时，芈雨索要的注意力报价<strong>不会低于当前注意力的 50%。</strong></del>神谕系统已关闭。</li>\n</ul>',
        },
        {
            id: 10,
            category: '通用',
            publish_at: 1721530325,
            sorting_index: 100,
            title: '勘误公告',
            content:
                '<p><strong>有关谜题的勘误将会统一在这里放送。请查收哦。</strong></p>\n<ul>\n<li>一道标题以“后”结尾的谜题，最后一部分，第一行、第三行、第五行括号中的数已被修正。</li>\n<li>一道标题以“夫”结尾的谜题，第十二条音频已修正（压缩包也已经修正）。</li>\n<li>一道标题为英文的谜题、一道标题以“扭”结尾的谜题，与一道标题以“莲”结尾的谜题，其“复制到腾讯文档”中的内容有所修正，修正为与各自原题一致。</li>\n<li>一道标题以“连”结尾的谜题，题面图片进行了优化。</li>\n<li>一道以“骰”结尾的谜题，题目图片进行了更正。</li>\n<li>一道以“站”结尾的谜题，题目的第五张图片进行了更正。</li>\n<li>一道以“点”结尾的谜题，题目图片进行了更正。</li>\n<li>一道以“园”结尾的谜题，补充了一些信息（可以把题面上的时间调整到 03:03 以查看）。</li>\n<li>一道以“园”结尾的谜题，某张题目图片进行了更正（可以把题面上的时间调整到 04:04 以查看）。</li>\n</ul>',
        },
        {
            id: 11,
            category: '通用',
            publish_at: 1721599251,
            sorting_index: 99,
            title: '前十名公布！',
            content:
                '<p>恭喜队伍 <strong>simplicissimus</strong> 完赛，用时 25:26:15，获得本次活动的冠军！\n注意力增速将从 2024-07-20 21:27 开始调整为每分钟增长 12 点。</p>\n<p>恭喜队伍 <strong>焖肉面不配姜丝醋不好吃</strong> 完赛，用时 31:27:37，获得本次活动的亚军！</p>\n<p>恭喜队伍 <strong>A hAsh ArcAdiA</strong> 完赛，用时 40:27:49，获得本次活动的季军！\n注意力增速将从 2024-07-21 12:30 开始调整为每分钟增长 15 点。</p>\n<p>恭喜队伍 <strong>睡眠不足互联网技术有限公司</strong> 完赛，用时 41:59:18，获得本次活动的殿军！</p>\n<p>恭喜队伍 <strong>野炊旅人</strong> 完赛，用时 45:56:43，获得本次活动的第五名！\n注意力增速将从 2024-07-21 17:56 开始调整为每分钟增长 20 点。</p>\n<p>恭喜队伍 <strong>ZJU反卷猫猫桶</strong>、<strong>世界美食official</strong>、<strong>zitmen</strong>、<strong>龙小组解谜！</strong>、<strong>--------金牌线--------</strong> 完赛，用时分别为 50:51:52、 51:26:06、52:14:59、54:37:57、57:59:40，获得本次活动的第六至十名！</p>',
        },
        {
            id: 7,
            category: '通用',
            publish_at: 1721423518,
            sorting_index: 1,
            title: '芈雨的信',
            content:
                '<p><center><em>(你在教堂内踱步，不知什么时候，地上出现了一张纸条。你将它捡了起来。)</em></center></p>\n<blockquote>\n<p>观测者，又见面了。</p>\n<p>看来你已经非常擅长在精神领域聆听我的<strong>神谕</strong>了，但是请注意，这种能力会消耗你大量的注意力，不到万不得已尽量不要使用。你应该相信你的观测能力，善用<strong>观测</strong>，你已经可以得到足够多的信息。</p>\n<p>我的状态目前并不稳定，如果申请了神谕但是没有帮我补充注意力会让我的精神状态更差，可能短时间内就无法聆听你的祈求了……</p>\n<p>如果你的解谜之旅遇到了困难，不如先看看我为你准备的<a target="_blank" rel="noopener noreferrer" href="/about/tools">工具</a>，或许对你有些帮助。</p>\n<p>那么，祝你在教堂里度过一段愉快的时光。</p>\n<p>芈雨</p>\n</blockquote>\n<hr>\n<p>我们注意到，目前很多队伍的神谕机制的使用方式并不符合我们的设计初衷。我们需要重申，神谕机制是作为观测机制的补充，往往需要消耗<strong>比观测更多的注意力</strong>，\n具体来说，同样的信息量，通过神谕获得需要比通过观测获得消耗更多的注意力。\n同时，神谕需要等待<strong>至少四个小时</strong>才能得到解答，并不是实时的，因此，应当慎重考虑之后再决定是否申请神谕。</p>\n<p>当您题目卡住时，建议首先使用观测系统，大多数题目目前的观测信息已经较为完备，随着完成比赛的队伍数量增加，可能还会放出信息量更多的观测。</p>\n<p>我们决定对神谕系统增加一条额外的限制，当您申请了神谕但是拒绝了报价时，您的神谕系统会被<strong>禁用两个小时</strong>，从申请神谕的时间开始计时。 随着之后注意力增速的增加，这个时长可能还会调整（增加）。</p>\n<p>作为参考，截至目前（7月20日 5:00），大多数队伍提交的神谕需要消耗的注意力都不低于 4000 点。</p>\n<p>关于观测与神谕的详细使用方法，请查看<a target="_blank" rel="noopener noreferrer" href="/area/intro">序章</a>中的介绍。</p>',
        },
        {
            id: 17,
            category: '通用',
            publish_at: 1722059361,
            sorting_index: -1,
            title: '神谕系统关闭通知',
            content:
                '<p>各位玩家大家好，距离比赛结束还有不到 2 天了。我们计划从今天 20:00 开始不再接受新的神谕请求，请各位玩家安排好自己队伍的答题节奏。</p>\n<p>考虑到很多新手玩家的体验和需求，我们决定在正赛结束之后开放一个新的游戏环境，可以体验到跟正赛几乎完全一致的题目解锁逻辑和操作体验，同时可以自由地跟别人进行讨论（因此这个环境中不再会有站内信、神谕等功能，而且静态存档站中直接就有题目的解析）。具体的开放时间和链接另行通知（暂定为 <a target="_blank" rel="noopener noreferrer" href="https://pnku3-playground.pkupuzzle.art">https://pnku3-playground.pkupuzzle.art</a>）。</p>\n<p>但是请注意，在正赛进行时请各位玩家严格遵守游戏简介中的<a target="_blank" rel="noopener noreferrer" href="https://pnku3.pkupuzzle.art/about/introduction">比赛须知</a>！</p>',
        },
        {
            id: 16,
            category: '通用',
            publish_at: 1721838370,
            sorting_index: -1,
            title: '服务器维护通知',
            content:
                '<p>我们计划在 7 月 25 日 0:30 开始进行服务器维护，维护时间大约 5 分钟。\n本次维护会增加一个简单的图片上传功能，主要用于在站内信和神谕中发图，届时会在站内信和神谕的对话页面看到入口。</p>',
        },
        {
            id: 15,
            category: '通用',
            publish_at: 1721733968,
            sorting_index: -1,
            title: '神谕功能调整',
            content: '<p>我们对神谕功能做了微调，玩家不能主动关闭神谕了。</p>',
        },
        {
            id: 8,
            category: '通用',
            publish_at: 1721448895,
            sorting_index: -1,
            title: '宣传激励奖励',
            content:
                '<p><strong>宣传激励</strong>奖励将于今晚8点颁发，目前我们已经正式开始接收提交，届时将会按照提交顺序发放注意力。\n请注意，提交的<strong>截止日期为今晚8点</strong>，即一旦正式开始发放注意力，就不再接受新的宣传激励的提交。</p>',
        },
        {
            id: 6,
            category: '通用',
            publish_at: 1721420968,
            sorting_index: -1,
            title: '服务器维护提醒',
            content:
                '<p>预计在 4:35 分进行服务器维护，维护时长在 10 分钟以内，请大家做好准备。</p>\n<hr/>\n<p>已完成。</p>',
        },
        {
            id: 4,
            category: '通用',
            publish_at: 1721399400,
            sorting_index: -1,
            title: '临时维护补偿公告',
            content:
                '<p>各位参赛选手好，由于感受到了各位玩家参与本次活动的热情，我们对服务器进行了一次临时升级。由此给各位参赛选手造成的不便，我们深感抱歉。\n我们决定向截至7月19日晚10:30已经开始比赛的队伍一次性发送2000点的注意力，请各位玩家查收。</p>',
        },
        {
            id: 3,
            category: '通用',
            publish_at: 1721389520,
            sorting_index: -1,
            title: '温馨提示',
            content:
                '<p>网站加载卡慢是由于服务器带宽限制。请耐心等待，不要短时间内多次刷新网页。</p>\n<p>同时，目前邮箱服务达到赛前峰值，如果注册或者重置密码时出现了诸如“请联系网站管理员”的字样，请不要一直发送邮件验证请求，而是等待一段时间后再注册。可以让无法注册的队友先通过队内的共享文档看题。比赛开始后队伍仍可添加成员，请稍安勿躁。</p>\n<p>比赛期间请遵守游戏简介中<strong>比赛须知</strong>一栏。感谢大家的支持！</p>',
        },
        {
            id: 2,
            category: '通用',
            publish_at: 1721387893,
            sorting_index: -1,
            title: '宣传激励计划',
            content:
                '<p>本次有<strong>宣传激励</strong>计划，其在比赛开始后 24 小时后有效（不是现在哦）：</p>\n<p>届时，如果您将P&amp;KU的信息及参赛方式（例如活动海报、活动网址等）分享至社交媒体，然后将证明截图通过站内信在<strong>宣传激励</strong>开启的时间点提交给staff，我们将会额外给予您的队伍5555注意力，以便您的队伍能操纵观测者更好地发起观测与请求神谕。但一个队伍最多凭借该种方式获得一次奖励。</p>\n<p>（比赛进行过程中，上述奖励可能会随着通货膨胀而发生变化。）</p>',
        },
    ],
    schedule: [
        {
            timestamp_s: 0,
            name: '活动即将开始',
            status: 'pst',
        },
        {
            timestamp_s: 1721386800,
            name: '序章开放',
            status: 'pst',
        },
        {
            timestamp_s: 1721390400,
            name: '活动开始',
            status: 'pst',
        },
        {
            timestamp_s: 1722168000,
            name: '活动结束',
            status: 'prs',
        },
    ],
};

export default data;
